# Libreria Pandas

## Data Wrangling: Clean, Transform, Merge, Reshape

In [1]:
import pandas as pd  #importa la libreria

import numpy as np

### Combinando y cruzando data sets

In [7]:
df_1 = pd.DataFrame({'num_1': range(7), 'keys': list('abcdefg')})
df_2 = pd.DataFrame({'num_2': range(20,23), 'keys': list('abd')})

In [8]:
df_1

  keys  num_1
0    a      0
1    b      1
2    c      2
3    d      3
4    e      4
5    f      5
6    g      6

In [9]:
df_2

  keys  num_2
0    a     20
1    b     21
2    d     22

Explicaci√≥n en JOINS:
https://www.codeproject.com/Articles/33052/Visual-Representation-of-SQL-Joins

<img src="https://i.stack.imgur.com/03hNZ.jpg">

In [13]:
df_1.merge(df_2)

  keys  num_1  num_2
0    a      0     20
1    b      1     21
2    d      3     22

In [14]:
df_2dup = pd.DataFrame({'num_2': range(20,24), 'keys': list('abda')})
df_2dup

  keys  num_2
0    a     20
1    b     21
2    d     22
3    a     23

In [15]:
df_1.merge(df_2dup)

  keys  num_1  num_2
0    a      0     20
1    a      0     23
2    b      1     21
3    d      3     22

In [16]:
df_3 = pd.DataFrame({'num_3': range(7), 'lkey': list('bbacaab')})
df_4 = pd.DataFrame({'num_4': range(3), 'rkey': list('abd')})

In [18]:
df_3.merge(df_4, left_on = 'lkey', right_on = 'rkey')

  lkey  num_3  num_4 rkey
0    b      0      1    b
1    b      1      1    b
2    b      6      1    b
3    a      2      0    a
4    a      4      0    a
5    a      5      0    a

### Comparando Joins

In [20]:
df_1.merge(df_2, how = 'inner')

  keys  num_1  num_2
0    a      0     20
1    b      1     21
2    d      3     22

In [21]:
df_1.merge(df_2, how = 'left')

  keys  num_1  num_2
0    a      0   20.0
1    b      1   21.0
2    c      2    NaN
3    d      3   22.0
4    e      4    NaN
5    f      5    NaN
6    g      6    NaN

In [22]:
df_1.merge(df_2, how = 'right')

  keys  num_1  num_2
0    a      0     20
1    b      1     21
2    d      3     22

In [24]:
df_1.merge(df_2, how = 'outer')

  keys  num_1  num_2
0    a      0   20.0
1    b      1   21.0
2    c      2    NaN
3    d      3   22.0
4    e      4    NaN
5    f      5    NaN
6    g      6    NaN

In [25]:
df_1['x'] = 2
df_2['x'] = 42

In [27]:
df_1.merge(df_2, on = 'keys')

  keys  num_1  x_x  num_2  x_y
0    a      0    2     20   42
1    b      1    2     21   42
2    d      3    2     22   42

In [28]:
df_1.merge(df_2, on = 'keys', suffixes = ('_left', '_right'))

  keys  num_1  x_left  num_2  x_right
0    a      0       2     20       42
1    b      1       2     21       42
2    d      3       2     22       42

In [30]:
df_1dup = pd.DataFrame({'num_1dup': range(4), 'num_1dup2': range(8,12)}, index = list('abcd'))
df_1dup

   num_1dup  num_1dup2
a         0          8
b         1          9
c         2         10
d         3         11

In [31]:
df_1.merge(df_1dup, left_on = 'keys', right_index = True)

  keys  num_1  x  num_1dup  num_1dup2
0    a      0  2         0          8
1    b      1  2         1          9
2    c      2  2         2         10
3    d      3  2         3         11

### Concatenaci√≥n

In [33]:
pd.concat([df_1, df_2])

  keys  num_1  num_2   x
0    a    0.0    NaN   2
1    b    1.0    NaN   2
2    c    2.0    NaN   2
3    d    3.0    NaN   2
4    e    4.0    NaN   2
5    f    5.0    NaN   2
6    g    6.0    NaN   2
0    a    NaN   20.0  42
1    b    NaN   21.0  42
2    d    NaN   22.0  42

In [34]:
a1 = np.arange(0,24).reshape(4,6)
a2 = np.arange(25,37).reshape(4,3)

In [40]:
a_concat = np.concatenate([a1,a2], axis = 1)
a_concat

array([[ 0,  1,  2,  3,  4,  5, 25, 26, 27],
       [ 6,  7,  8,  9, 10, 11, 28, 29, 30],
       [12, 13, 14, 15, 16, 17, 31, 32, 33],
       [18, 19, 20, 21, 22, 23, 34, 35, 36]])

In [41]:
s1 = pd.Series(range(4), index = list('abcd'))
s2 = pd.Series(range(10,13), index = list('lmn'))
s3 = pd.Series(range(40,43), index = list('xyz'))

In [42]:
pd.concat([s1,s2,s3])

a     0
b     1
c     2
d     3
l    10
m    11
n    12
x    40
y    41
z    42
dtype: int64

In [43]:
pd.concat([s1,s2,s3], axis = 1)

     0     1     2
a  0.0   NaN   NaN
b  1.0   NaN   NaN
c  2.0   NaN   NaN
d  3.0   NaN   NaN
l  NaN  10.0   NaN
m  NaN  11.0   NaN
n  NaN  12.0   NaN
x  NaN   NaN  40.0
y  NaN   NaN  41.0
z  NaN   NaN  42.0

In [44]:
pd.concat([s1,s2,s3], axis = 1, keys = ['s1','s2','s3'])

    s1    s2    s3
a  0.0   NaN   NaN
b  1.0   NaN   NaN
c  2.0   NaN   NaN
d  3.0   NaN   NaN
l  NaN  10.0   NaN
m  NaN  11.0   NaN
n  NaN  12.0   NaN
x  NaN   NaN  40.0
y  NaN   NaN  41.0
z  NaN   NaN  42.0

In [48]:
pd.concat([df_1, df_2])

  keys  num_1  num_2   x
0    a    0.0    NaN   2
1    b    1.0    NaN   2
2    c    2.0    NaN   2
3    d    3.0    NaN   2
4    e    4.0    NaN   2
5    f    5.0    NaN   2
6    g    6.0    NaN   2
0    a    NaN   20.0  42
1    b    NaN   21.0  42
2    d    NaN   22.0  42

In [49]:
pd.concat([df_1, df_2], ignore_index = True)

  keys  num_1  num_2   x
0    a    0.0    NaN   2
1    b    1.0    NaN   2
2    c    2.0    NaN   2
3    d    3.0    NaN   2
4    e    4.0    NaN   2
5    f    5.0    NaN   2
6    g    6.0    NaN   2
7    a    NaN   20.0  42
8    b    NaN   21.0  42
9    d    NaN   22.0  42

### Data Transformation

In [52]:
df_a = pd.DataFrame({'keys_1': ['one'] * 3 + ['two'] * 4,
                    'keys_2': [1,1,2,3,3,4,4]})
df_a

  keys_1  keys_2
0    one       1
1    one       1
2    one       2
3    two       3
4    two       3
5    two       4
6    two       4

In [53]:
df_a.duplicated()

0    False
1     True
2    False
3    False
4     True
5    False
6     True
dtype: bool

In [56]:
df_a.drop_duplicates()

  keys_1  keys_2
0    one       1
2    one       2
3    two       3
5    two       4

In [57]:
df_a.drop_duplicates(keep = 'last')

  keys_1  keys_2
1    one       1
2    one       2
4    two       3
6    two       4

In [59]:
df_a.index = list('abcdefg')
df_a

  keys_1  keys_2
a    one       1
b    one       1
c    one       2
d    two       3
e    two       3
f    two       4
g    two       4

In [60]:
ages = [18, 25, 22, 45, 91, 67, 20, 38, 38, 56]
bins = [15, 25, 35, 65, 100]

In [61]:
cuts = pd.cut(ages, bins)
cuts.value_counts()

(15, 25]     4
(25, 35]     0
(35, 65]     4
(65, 100]    2
dtype: int64

In [97]:
cuts = pd.cut(ages, bins, right = False)
cuts.value_counts()

[15, 25)     3
[25, 35)     1
[35, 65)     4
[65, 100)    2
dtype: int64

### String manipulation

In [62]:
string = 'this is some sentence'
string.split()

['this', 'is', 'some', 'sentence']

In [63]:
animals = 'rhino giraffe molerat mantisshrimp cheetah mosquito whale'.split()
animals

['rhino', 'giraffe', 'molerat', 'mantisshrimp', 'cheetah', 'mosquito', 'whale']

In [65]:
list(map(lambda x: x.capitalize(), animals))

['Rhino', 'Giraffe', 'Molerat', 'Mantisshrimp', 'Cheetah', 'Mosquito', 'Whale']

In [96]:
list(map(lambda x: x.lower().strip('m'), animals))

['rhino', 'giraffe', 'olerat', 'antisshrimp', 'cheetah', 'osquito', 'whale']

In [68]:
df_a['animals'] = animals
df_a

  keys_1  keys_2       animals
a    one       1         rhino
b    one       1       giraffe
c    one       2       molerat
d    two       3  mantisshrimp
e    two       3       cheetah
f    two       4      mosquito
g    two       4         whale

In [69]:
df_a['animals'].str.upper()

a           RHINO
b         GIRAFFE
c         MOLERAT
d    MANTISSHRIMP
e         CHEETAH
f        MOSQUITO
g           WHALE
Name: animals, dtype: object

In [70]:
df_a['animals'].str.len()

a     5
b     7
c     7
d    12
e     7
f     8
g     5
Name: animals, dtype: int64

In [71]:
df_a['animals'].str.count('o')

a    1
b    0
c    1
d    0
e    0
f    2
g    0
Name: animals, dtype: int64

In [72]:
df_a['animals'].str.contains('m')

a    False
b    False
c     True
d     True
e    False
f     True
g    False
Name: animals, dtype: bool

In [73]:
df_a[df_a['animals'].str.contains('m')]

  keys_1  keys_2       animals
c    one       2       molerat
d    two       3  mantisshrimp
f    two       4      mosquito

In [78]:
df_a['animals'] = df_a['animals'].str.upper()
df_a

  keys_1  keys_2       animals
a    one       1         RHINO
b    one       1       GIRAFFE
c    one       2       MOLERAT
d    two       3  MANTISSHRIMP
e    two       3       CHEETAH
f    two       4      MOSQUITO
g    two       4         WHALE

In [74]:
series_with_blanks = pd.Series(['SDF    ', ' RTTR     ', 'BL   '])
series_with_blanks

0       SDF
1     RTTR
2         BL
dtype: object

In [75]:
series_with_blanks.str.rstrip()

0      SDF
1     RTTR
2       BL
dtype: object

## Data Aggregation and Group Operations

### Groupby

In [2]:
df_a = pd.DataFrame({'producto': list('aabba'),
                     'vendedor': ['Juan','Celia','Juan','Celia','Juan'],
                     'balance': np.random.randn(5) * 10,
                     'ingreso': np.random.randn(5) + 2})
df_a

     balance   ingreso producto vendedor
0   6.649192  1.589062        a     Juan
1 -12.653578  2.917045        a    Celia
2   9.619043  1.720404        b     Juan
3   3.774009  2.318544        b    Celia
4  -5.916111  1.461327        a     Juan

In [3]:
df_a.mean()

balance    0.294511
ingreso    2.001276
dtype: float64

Pero s√≥lo esta informaci√≥n no nos da informaci√≥n sobre los diferentes productos. Podemos querer obtener el balance y los ingresos medios por producto (o por vendedeor!). Para ello podemos agrupar por variable: **groupby**.

In [6]:
media_producto = df_a.groupby('producto').mean()
media_producto

           balance   ingreso
producto
a        -3.973499  1.989145
b         6.696526  2.019474

Tambi√©n podemos acceder directamente a la variable que nos interese. Por ejemplo, si s√≥lo queremos conocer el balance medio por producto:

In [7]:
media_producto_balance = df_a.groupby('producto')['balance'].mean()
media_producto_balance

producto
a   -3.973499
b    6.696526
Name: balance, dtype: float64

Podemos agrupar utilizando m√°s de una variable. Por ejemplo, agrupando primero por *producto* y luego por *vendedor*:

In [9]:
df_a.groupby(['producto','vendedor']).mean()

                     balance   ingreso
producto vendedor
a        Celia    -12.653578  2.917045
         Juan       0.366540  1.525194
b        Celia      3.774009  2.318544
         Juan       9.619043  1.720404

Otra forma de acceder a algunas funciones reservadas como es **mean** (o **count**) es a trav√©s del m√©todo aggregate dentro de **groupby**.**agg**

In [10]:
df_a.groupby(['producto','vendedor']).agg(['mean','count'])

                     balance         ingreso
                        mean count      mean count
producto vendedor
a        Celia    -12.653578     1  2.917045     1
         Juan       0.366540     2  1.525194     2
b        Celia      3.774009     1  2.318544     1
         Juan       9.619043     1  1.720404     1

Podemos a√±adir funciones arbitrarias al m√©todo agg() de objetos groupby:

In [12]:
#Functi√≥n para sumar el n√∫mero de caracteres de una serie de strings.
def len_str_sum(m):
    return m.str.len().sum()

In [13]:
df_a.groupby(['producto'])['vendedor'].agg(len_str_sum)

producto
a    13
b     9
Name: vendedor, dtype: int64

Lo mismo de forma m√°s compacta con lambda functions:

In [14]:
df_a.groupby(['producto'])['vendedor'].agg(lambda x: x.str.len().sum())

producto
a    13
b     9
Name: vendedor, dtype: int64

### Iterating over groups

Podemos iterar sobre los objetos agrupados. Iterar sobre ellos produce tuples (key,group), por lo tanto podemos extraer nuestros datos por grupo.

In [15]:
for key,group in df_a.groupby('producto'):
    print("Tipo de producto: %s" % key)
    print("Datos de producto:\n %s" % group)

Tipo de producto: a
Datos de producto:
      balance   ingreso producto vendedor
0   6.649192  1.589062        a     Juan
1 -12.653578  2.917045        a    Celia
4  -5.916111  1.461327        a     Juan
Tipo de producto: b
Datos de producto:
     balance   ingreso producto vendedor
2  9.619043  1.720404        b     Juan
3  3.774009  2.318544        b    Celia

In [19]:
list(df_a.groupby('producto'))

[('a',      balance   ingreso producto vendedor
  0   6.649192  1.589062        a     Juan
  1 -12.653578  2.917045        a    Celia
  4  -5.916111  1.461327        a     Juan),
 ('b',     balance   ingreso producto vendedor
  2  9.619043  1.720404        b     Juan
  3  3.774009  2.318544        b    Celia)]

y producir diccionarios de dataframe:

In [23]:
df_producto = dict(list(df_a.groupby('producto')))
df_producto

{'a':      balance   ingreso producto vendedor
 0   6.649192  1.589062        a     Juan
 1 -12.653578  2.917045        a    Celia
 4  -5.916111  1.461327        a     Juan,
 'b':     balance   ingreso producto vendedor
 2  9.619043  1.720404        b     Juan
 3  3.774009  2.318544        b    Celia}

In [24]:
df_producto['a']['balance']

0     6.649192
1   -12.653578
4    -5.916111
Name: balance, dtype: float64

### Data aggregation

Para esta parte vamos a descargar un archivo online:

In [27]:
import requests

url = 'https://raw.githubusercontent.com/wesm/pydata-book/1st-edition/ch08/tips.csv'
response = requests.get(url)

out_file = open('tips.csv', 'wb')
out_file.write(response.content)
out_file.close()

In [28]:
tips = pd.read_csv('tips.csv')
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

### Pivot & unstack

Podemos pivotar nuestro grouped dataframe alrededor de la variable deseada con el comando **unstack**

In [30]:
stacked = df_a.groupby(['producto', 'vendedor']).mean()
stacked

                     balance   ingreso
producto vendedor
a        Celia    -12.653578  2.917045
         Juan       0.366540  1.525194
b        Celia      3.774009  2.318544
         Juan       9.619043  1.720404

In [31]:
stacked.unstack('vendedor')

            balance             ingreso
vendedor      Celia      Juan     Celia      Juan
producto
a        -12.653578  0.366540  2.917045  1.525194
b          3.774009  9.619043  2.318544  1.720404

In [32]:
stacked.unstack('vendedor').unstack('balance')

         vendedor  producto
balance  Celia     a          -12.653578
                   b            3.774009
         Juan      a            0.366540
                   b            9.619043
ingreso  Celia     a            2.917045
                   b            2.318544
         Juan      a            1.525194
                   b            1.720404
dtype: float64

In [35]:
df_a[df_a['vendedor'] == 'Celia'].groupby('producto').mean()

            balance   ingreso
producto
a        -12.653578  2.917045
b          3.774009  2.318544

In [34]:
df_a[df_a['vendedor'] == 'Celia'].groupby('producto').mean().unstack()

         producto
balance  a          -12.653578
         b            3.774009
ingreso  a            2.917045
         b            2.318544
dtype: float64

In [36]:
df_a.pivot(columns = 'producto')

            balance             ingreso           vendedor
producto          a         b         a         b        a      b
0          6.649192       NaN  1.589062       NaN     Juan   None
1        -12.653578       NaN  2.917045       NaN    Celia   None
2               NaN  9.619043       NaN  1.720404     None   Juan
3               NaN  3.774009       NaN  2.318544     None  Celia
4         -5.916111       NaN  1.461327       NaN     Juan   None

Esto muestra cada una de las entradas de nuestra tabla en relaci√≥n al tipo de producto para cada una de las diferentes columnas de la tabla.

### Example: Filling missing values with group-specific values

In [37]:
states = ['Ohio','New York','Vermont','Florida','Oregon','Nevada','California','Idaho']
states

['Ohio',
 'New York',
 'Vermont',
 'Florida',
 'Oregon',
 'Nevada',
 'California',
 'Idaho']

In [39]:
df_us = pd.DataFrame({'states':states,
                      'market':['East'] * 4 + ['West'] * 4,
                      'data':[100,82,83,np.nan,20,30,np.nan,np.nan]})
df_us

    data market      states
0  100.0   East        Ohio
1   82.0   East    New York
2   83.0   East     Vermont
3    NaN   East     Florida
4   20.0   West      Oregon
5   30.0   West      Nevada
6    NaN   West  California
7    NaN   West       Idaho

Podemos utilizar apply para aplicar una funci√≥n sobre la serie.

In [43]:
df_us.groupby('market')['data'].apply(lambda x: x.fillna(x.mean()))

0    100.000000
1     82.000000
2     83.000000
3     88.333333
4     20.000000
5     30.000000
6     25.000000
7     25.000000
Name: data, dtype: float64

In [44]:
df_us2=df_us.copy()

In [45]:
df_us2['data']=df_us.groupby(['market'])['data'].apply(lambda x: x.fillna(x.mean()))
df_us2

         data market      states
0  100.000000   East        Ohio
1   82.000000   East    New York
2   83.000000   East     Vermont
3   88.333333   East     Florida
4   20.000000   West      Oregon
5   30.000000   West      Nevada
6   25.000000   West  California
7   25.000000   West       Idaho

Tambi√©n podemos asignar valores seg√∫n el valor de la variable utilizando groupby y un diccionario para la transformaci√≥n.

In [53]:
fill_values = {'East': 10, 'West': 200}
fill_func = lambda g: g.fillna(fill_values[g.name])

df_us.groupby('market').apply(fill_func)

    data market      states
0  100.0   East        Ohio
1   82.0   East    New York
2   83.0   East     Vermont
3   10.0   East     Florida
4   20.0   West      Oregon
5   30.0   West      Nevada
6  200.0   West  California
7  200.0   West       Idaho